[
	{
		"tunniste" : "1.1.1",
		"nimi" : "Ei-tekstuaalinen sisältö",
		"taso" : "A",
		"selite" : "Kaikki käyttäjälle esitettävä ei-tekstuaalinen sisältö on varustettu saman tarpeen täyttävällä tekstivastineella, pois lukien alla luetellut tapaukset.",
		"alaselite" : ["Kontrollit, syöte: Ei-tekstuaalisella sisällöllä on sen tarkoituksen kuvaava nimi, jos se toimii kontrollina tai vastaanottaa käyttäjän syötettä. (Tutustu ohjeeseen 4.1 saadaksesi lisää vaatimuksia kontrolleille ja käyttäjän syötettä vastaanottavalle sisällölle.)",
			"Aikasidonnainen media: Jos ei-tekstuaalinen sisältö on aikasidonnaista mediaa, tekstivastineet tarjoavat vähintään kuvailevan tunnistetiedon ei-tekstuaalisesta sisällöstä. (Tutustu ohjeeseen 1.2 saadaksesi lisävaatimuksia medialle.)",
		    "Testi: Jos ei-tekstuaalinen sisältö on testi tai harjoitus, joka ei olisi tekstinä esitettynä pätevä, tarjoavat tekstivastineet vähintään kuvailevan tunnistetiedon ei-tekstuaalisesta sisällöstä.",
			"Aistinvarainen: Jos ei-tekstuaalinen sisältö on ensisijaisesti tarkoitettu aikaansaamaan tietty aistinvarainen kokemus, niin tekstivastineet tarjoavat vähintään kuvailevan tunnistetiedon ei-tekstuaalisesta sisällöstä.",
			"CAPTCHA: Jos ei-tekstuaalisen sisällön tarkoitus on varmistaa, että sisältöä käyttää henkilö eikä tietokone, niin tarjolla on tekstivastineita, jotka tunnistavat ja kuvailevat ei-tekstuaalisen sisällön tarkoituksen. Lisäksi tarjolla on vaihtoehtoisia CAPTCHA-muotoja, jotka ottavat huomioon erilaiset vammat ja rajoitteet käyttäen eri aistinvaraisia havaintoja tukevia esitystapoja.",
			"Koristeet, muotoilu, näkymättömyys: Jos ei-tekstuaalinen sisältö on yksinomaan koriste, jos sitä käytetään ainoastaan visuaaliseen muotoiluun tai jos se on käyttäjälle näkymätön, se toteutetaan siten, että avustava teknologia voi jättää sen huomioimatta."],
		"linkki" : "https://www.w3.org/Translations/WCAG21-fi/#non-text-content"
	},
	{
		"tunniste" : "1.2.1",
		"nimi" : "Pelkkä audio tai pelkkä video (tallennettu)",
		"taso" : "A",
		"selite" : "Seuraava pätee tallennetulle pelkälle audiomedialle ja tallennetulle pelkälle videomedialle, paitsi kun audio tai video on tekstin mediavastine ja selvästi merkitty sellaiseksi:",
		"alaselite" : ["Pelkkä tallennettu audio: Tarjolla on aikasidonnaiselle medialle vastine, joka esittää vastaavan sisällön kuin tallennettu pelkkä audiosisältö.",
		"Pelkkä tallennettu video: Tarjolla on joko vastine aikasidonnaiselle medialle tai audiotiedosto, joka esittää vastaavan informaation kuin tallennettu pelkkä videosisältö."],
		"linkki" : "https://www.w3.org/Translations/WCAG21-fi/#audio-only-and-video-only-prerecorded"
	},
	{
		"tunniste" : "1.2.2",
		"nimi" : "Tekstitys (tallennettu)",
		"taso" : "A",
		"selite" : "Kaikelle synkronoidussa mediassa olevalle tallennetulle audiosisällölle on tarjolla tekstitys, paitsi kun media on tekstin mediavastine ja selvästi merkitty sellaiseksi.",
		"linkki" : "https://www.w3.org/Translations/WCAG21-fi/#captions-prerecorded"
	}
]


